Eva_Final.yml
---
execution:
- executor: jmeter
  concurrency: 20
  hold-for: 5m
  ramp-up: 60s
  scenario: Thread Group
scenarios:
  Thread Group:
    requests:
    - label: evademo_jmeter
      method: GET
      url: http://172.29.221.77/
reporting:
- module: junit-xml
  filename: Evajunit.xml
  data-source: pass-fail
services:
- module: passfail
criteria:
  - fail>5% for 10s, stop as failed