Eva_Final.yml
---
execution:
- executor: jmeter
  concurrency: 10
  hold-for: 5m
  ramp-up: 60s
  scenario: Thread Group
scenarios:
  Thread Group:
    requests:
    - label: evademo_jmeter
      method: GET
      url: http://172.29.221.77/
reporting:
- module: junit-xml
  filename: Evajunit.xml
  data-source: pass-fail
  
- module: final_stats
  summary: true
  percentiles: true
  failed-labels: false
  test-duration: true
  dump-csv: Eva.csv
  
services:
- module: passfail
criteria:
  - fail>25% for 50s, stop as failed