Eva_Final.yml

---
execution:
- executor: jmeter
  concurrency: 20
  hold-for: 5m
  ramp-up: 60s
  scenario: Thread Group
scenarios:
  Thread Group:
    requests:
    - label: evademo_jmeter
      method: GET
      url: http://172.29.221.77/
reporting:
- module: final_stats
  summary: true  # overall samples count and percent of failures
  percentiles: true  # display average times and percentiles
  failed-labels: false  # provides list of sample labels with 

failures
  test-duration: true  # provides test duration
  dump-xml: Eva_final.xml
  dump-csv: Eva_final.csv