selenium_eva.yml
---
execution:
- executor: selenium
  concurrency: 20
  hold-for: 5m
  ramp-up: 60s
  scenario: Selenium_Eva
scenarios:
  Selenium_Eva:
    script: Eva_Login_Page.js

reporting:
- module: junit-xml
  filename: EvaSelenium.xml
  data-source: pass-fail
  
- module: final_stats
  summary: true
  percentiles: true
  failed-labels: false
  test-duration: true
  dump-csv: selenium.csv
  
services:
- module: passfail
criteria:
  - fail>5% for 10s, stop as failed